{
  "projects": [
    {
      "id": "movie-database",
      "title": "Movie Database",
      "description": "This is a movie database app that allows users explore current movies and view their details. It was built using React Native and we utilized TMDB's API to dynamically fetch all the data. Users are able to search for movies, filter movies, and have a personalized list of favourite movies.",
      "homeImage":"https://i.imgur.com/EIUGiQV.jpg",
      "homeImageAlt": "Movie Database Home Page",
      "image": [
        {
          "title": "Mobile View",
          "imgUrl": "https://i.imgur.com/RzUfMZC.jpg"
        },
        {
          "title": "desktopTop",
          "imgUrl": "https://i.imgur.com/APBbVMQ.jpg"
        },
        {
         "title": "desktopBot",
          "imgUrl": "https://i.imgur.com/zGF83QT.jpg"
        }
      ],
      "accordionItems": [
        {
          "title": "Planning",
          "content": "This project was developed by a team of three, consisting of myself and two classmates: Crystal Chen and Yui Sakamoto. Initially, each of us created our own mockups for a different class, focusing on a movie website. Eventually, we chose Yui's design as the foundation for our site, while also incorporating elements from Crystal's and my own designs. Our primary goal was to create a simple and user-friendly website that provides easy navigation. Additionally, we ensured that the site is fully responsive, offering a seamless experience across all devices."
        },
        {
          "title": "Highlights",
          "contentTitle": "Movie Categories",
          "content": "We created a filter feature to provide users with the ability to sort movies using four distinct categories: popular, top-rated, now playing, and upcoming. We achieved this by dynamically updating the API call according to the selected category, ensuring that the correct data was fetched and displayed to the users.",
          "codeLink": "https://github.com/chencxw/movie-database/blob/main/src/pages/PageHome.js#L23"
        },
        {
          "title": "Reflection",
          "content": "Filmbox was my first major React app, and it proved to be an invaluable learning experience. Throughout the project, I delved into various aspects of React development, including making API calls, utilizing React Router, managing state with React Redux, leveraging React hooks (especially useEffect), and storing data locally. One of the highlights was discovering how to dynamically fetch data from APIs, transforming the app with real-time and dynamic content. Working collaboratively with my teammate was a great pleasure. Our strengths complemented each other, enabling us to support one another and keep the development process smooth and enjoyable. The supportive team environment made a significant difference in the overall experience. This movie database project taught me the value of collaboration and teamwork. We capitalized on each other's strengths, allowing us to tackle challenges effectively and efficiently. It was inspiring to witness how our combined efforts led to faster progress and the successful implementation of additional features. Celebrating the completion of the project as a team was truly rewarding. While there is always room for improvement , the teamwork has resulted in a well-rounded project, in our opinion at least, that reflects our current skill level."
        }
      ],
      "technologies": "React Native, JavaScript, SASS",
      "url": "https://bricechen.ca/movie-database/",
      "class": "project2",
      "github": "https://github.com/chencxw/movie-database"
    },
    {
      "id": "capstone-project",
      "title": "Capstone Project",
      "description":"A comprehensive multi-page e-commerce website using Wordpress and WooCommerce for Healing Haven Massage clinic. The website provides clients with valuable information about the clinic and its skilled therapists. Clients can conveniently book appointments online and access a collection of the latest blog posts, staying updated on relevant topics.",
      "homeImage":"https://i.imgur.com/n6mYl2G.jpg",
      "homeImageAlt": "coming soon",
      "image": [
        {
          "title": "Home Desktop View",
          "imgUrl": "https://i.imgur.com/9KLwc2S.png"
        },
        {
          "title": "Services Mobile View",
          "imgUrl": "https://i.imgur.com/nnUDefL.png"
        },
        {
          "title": "Services Desktop View",
          "imgUrl": "https://i.imgur.com/8ZDdkDp.png"
        },
        {
         "title": "Contact Desktop View",
          "imgUrl": "https://i.imgur.com/5J1QdBp.png"
        }
      ],
      "accordionItems": [
        {
          "title": "Planning",
          "content": "This project was developed in a team of 4 as the Capstone project for our Front-End Web Developer program at BCIT. We were tasked with creating a website for a client, Healing Haven, a local business that offers a variety of services, including massage therapy. The client requested a website that would allow them to showcase their services and provide information about their staff. Additionally, they wanted to offer online booking and e-commerce capabilities. Our primary goal was to create a user-friendly website that would allow users to easily navigate the site and access the information they need. We also aimed to create a seamless booking and shopping experience, ensuring that users can easily book appointments and purchase products."
        },
        {
          "title": "Highlights",
          "content": "Some highlights for this project is succesfully integrating the Google Map API and customizing the colours. We also have a bookings page where clients can book the service of their choice with their preferred massage therapist with options of paying online or in person. This was created through the use of WooCommerce's booking plugin and utilizing CSS to customize it to our liking."
        },
        {
          "title": "Reflection",
          "content": "Throughout this project, I had the chance to enhance my skills in custom post types, taxonomies, Advanced Custom Fields, WooCommerce plugins, migrating WordPress sites, WordPress/WooCommerce hooks, and integrating Google Maps' API with a customized map. Working with WordPress as a content management system offered valuable benefits, allowing clients to control their website content while enabling us to customize the backend for a better user experience. A crucial takeaway he importance of adaptability and problem-solving skills. Throughout the development process, we encountered various challenges and unexpected issues that required quick thinking and innovative solutions. This experience taught me how to remain flexible in the face of obstacles and to approach problem-solving with a proactive mindset. Embracing challenges as opportunities for growth, I learned to explore alternative approaches and implement creative solutions, ultimately enhancing my ability to tackle complex tasks in future projects."
        }
      ],
      "technologies": "WordPress, SASS, JavaScript, PHP",
      "url": "https://healinghaven.bcitwebdeveloper.ca/",
      "github": "https://github.com/htpwebdesign/healing-haven",
      "class" : "project1"
    },
    {
      "id": "project3",
      "title": "Portfolio Site",
      "description": "For this project, I created a portfolio site to showcase the work I have done so far. I used React to build the site and used a mix of Tailwind and SASS for styling. I also used React Router to create a single page application. I created a JSON file to hold information for all the projects and pulled the information from it to dynamically create the project pages.",
      "homeImage":"https://i.imgur.com/wrFyrTC.jpg",
      "image": [
        {
          
          "imgUrl": "https://i.imgur.com/oUz9zqX.png"
        },
        {
          
          "imgUrl": "https://i.imgur.com/zmk6Wew.png"
        },
        {
         
          "imgUrl": "https://i.imgur.com/66v4Yen.jpg"
        }
      ],
      "accordionItems": [
        {
          "title": "Planning",
          "content": "Similar to the other projects, I first started out by looking through many of the past students portfolios to gain inspiration as to what I want on my site. From there, I started with a site map and content plan to help organize things which led to a wireframe/mockup. I at first thought that the mockup I had previously created would serve me fine for this site however, I kept having second thoughts and new ideas as I was building. The following picture is what I had for the mockup and as you can see, the final site is quite a bit different."
        },
        {
          "title": "Highlights",
          "content": "Some highlights for this project include having a responsive design. This ensures the websites useability across all screen sizes and allows users the ability to access and navigate the site regardless of what they are using. Also, wherever possible, I wrote code in a way that can be reused in other places on the site to follow the 'DRY' principle. To facilitate content management and streamline the addition of new projects, I opted to utilize a JSON file to store all project information. This strategic decision separates content from code, making it effortless to update the site without requiring any code changes. I also used React Router to create a single page application. This allows the user to navigate the site without having to reload the page."
        },
        {
          "title": "Reflection",
          "content": "This is my first big project and working on it alone. There were many difficulties that I came across as I was working away at this project. First and foremost, I started to dislike my original design and wanted to change it. I ended up changing the design quite a bit and while I am much happier with the final result, it took a lot of time as I couldn't just follow along a pre-made mockup. I also had a hard time with the JSON file. I had to do a lot of research to figure out how structure the actual file itself so I was able to pull the information and display it how I want on the site. Another thing is usage of Tailwind. Using tailwind felt very different and I had to fight the urge to just give up and move back to something more comfortable like SASS to style everything. I used Tailwind to style everything that I can but there were a few places where I couldn't get it to work properly. Despite all this, I felt I was able to learn a lot from this project and I am also happy that I was able to create a site that I can use to showcase my work."
        }
      ],
      "technologies": "React, JavaScript, HTML, Tailwind, SASS, JSON",
      "url": "https://bricechen.ca",
      "class": "project3",
      "github": "https://github.com/bChen-95/portfolio-site"
    }
   
  ]
}
    